Repository: yogimogi/yoimagelabeler
Catalog: lib/l10n/messages_*.arb
Languages: de

# app_title
source: Image Labeler App
de: Bildbeschriftung App

# menuitem_labels
source: Labels
de: Beschriftungen

# menuitem_export
source: Export
de: Exportieren

# menuitem_stats
source: Stats
de: Statistiken

# menuitem_logs
source: Logs
de: Protokolle

# labels_screen_title
source: Manage Labels
de: Beschriftungen Verwalten

# new_class_tooltip
source: Add New Class
de: Neue Klasse Hinzufügen

source: Create Class
de: Klasse Erstellen

source: Edit Class
de: Klasse Bearbeiten

source: Delete Class
de: Klasse Löschen

source: Class Name
de: Klassenname

# db_class_insert_error
source: Error creating Class with name '{name}'.
de: Fehler beim Erstellen der Klasse mit dem Namen '{name}'.

# db_class_update_error
source: Error updating Class with name '{name}'.
de: Fehler beim Bearbeiten der Klasse mit dem Namen '{name}'.

# class_name_empty
source: Empty string not allowed for Class Name.
de: Leere Zeichenfolge für Klassennamen nicht erlaubt.

# class_name_valid_chars
source: Class Name can contain only alpha numeric characters and _.
de: Der Klassenname darf nur alphanumerische Zeichen und _ enthalten.

# class_name_issue
source: Class with name '{name}' already exists.
de: Klasse mit dem Namen '{name}' schon existiert.

# delete_class_confirmation
source: {count, plural, =0{Are you sure?} =1{Are you sure, class '{name}' is used to label {count} image.?} other{Are you sure, class '{name}' is used to label {count} images.?}}
de: {count, plural, =0{Sind Sie sicher?} =1{Sind Sie sicher, Klasse '{name}' ist verwendet um ein Bild zu beschriften.?} other{Sind Sie sicher, Klasse '{name}' ist verwendet um {count} Bilder zu beschriften.?}}

# class_creation_success
source: Class created successfully.
de: Klasse erfolgreich erstellt.

# class_update_success
source: Class updated successfully.
de: Klasse erfolgreich bearbeitet.

# class_delete_success
source: Class '{name}' deleted successfully.
de: Klasse '{name}' erfolgreich gelöscht.

source: Cancel
de: Abbrechen

source: Save
de: Sichern

source: Yes
de: Ja

source: No
de: Nein

# positive_class
source: Pigeon
de: Taube

# negative_class
source: Not_Pigeon
de: Nicht_Taube

# error_add_image
source: Error Adding new Image to Collection.
de: Fehler beim Hinzufügen eines neuen Bildes zur Kollektion.

# error_update_image
source: Error updating Image.
de: Fehler bei der Aktualisierung des Bildes.

source: Camera
de: Kamera

# no_cameras_found
source: No Cemeras found on the device..
de: Keine Kameras gefunden auf dem Gerät.

# cameras_found
source: {count, plural, =1{1 Camera '{name}' found.} other{{count} Cameras found, using '{name}'.}}
de: {count, plural, =1{Eine Kamera '{name}' auf dem Gerät gefunden.} other{{count} Kameras auf dem Gerät gefunden, '{name}' wird verwendet.}}

# error_file_size
source: Error getting size of the file '{path}'
de: Fehler beim Abrufen der Dateigröße '{path}'

# images_dir_exists
source: Images directory '{path}' exists.
de: Bilderverzeichnis '{path}' schon existiert.

# images_dir_created
source: Images directory '{path}' created.
de: Bilderverzeichnis '{path}' angelegt.

source: error
de: Fehler

# add_camera_picture_title
source: Take a picture
de: Machen Sie ein Foto

source: Exposure Mode
de: Belichtungsmodus

# reset_exposure_point
source: Resetting exposure point.
de: Belichtungspunkt wird zurückgesetzt.

source: LOCKED
de: Gesperrt

source: Exposure Offset
de: Belichtungsoffset

# focus_mode
source: Focuse Mode
de: Fokusmodus

# reset_focus_point
source: Resetting focus point.
de: Fokuspunkt wird zurückgesetzt.

# flash_mode_set
source: Flash mode set to '{mode}'.
de: Blitzmodus auf '{mode}' eingestellt.

# exposure_mode_set
source: Exposure mode set to '{mode}'.
de: Belichtungsmodus auf '{mode}' eingestellt.

# focus_mode_set
source: Focus mode set to '{mode}'.
de: Fokusmodus auf '{mode}' eingestellt.

source: Image could not be captured.
de: Bild konnte nicht erfasst werden.

# image_added_to_collection
source: Image added to collection successfully.
de: Bild erfolgreich zur Kollektion hinzugefügt.

# added_image_path
source: Newly Added image location: '{path}'
de: Neu hinzugefügter Bildspeicherort: '{path}'

# big_camera_error_message
source: Camera is either not available on the device or permission to use it denied. For the latter, go to 'Settings->Apps->Image Labeler App->Permissions' and grant Camera permission.
de: Die Kamera ist entweder nicht auf dem Gerät verfügbar oder die Berechtigung sie zu verwenden wurde verweigert. Für letzteres, gehen Sie zu 'Einstellungen-> Apps-> Bildbeschriftung App-> Berechtigungen' und zulassen Sie die Kamera Zugriff.

# logs_title
source: Logs (current run)
de: Protokolle (aktueller Lauf)

# stats_title
source: Stats
de: Statistiken

# not_labelled
source: Not Labeled
de: Nicht beschriftet

source: Images
de: Bilder

source: Database
de: Datenbank

source: Type
de: Typ

source: Size on Disk
de: Größe auf der Festplatte

source: Images per Class
de: Bilder pro Klasse

# unlabeled_directory
source: un-labeled
de: nicht-beschriftet

source: Export successful
de: Export erfolgreich

# export_success_message
source: File '{path}' exported in '{time}' seconds.
de: Datei '{path}' in '{time}' Sekunden exportiert.

# export_progress_message
source: Exporting '{num}' images...
de: '{num}' Bilder werden exportiert...

source: Export Progress Indicator
de: Exportieren Fortschrittsanzeige

# label_picture_title
source: Label the Picture
de: Beschriften Sie das Bild

source: Assign Class
de: Klasse Zuweisen

source: Add
de: Hinzufügen

# no_classes
source: There are no classes created.
de: Es wurden keine Klassen erstellt.

# class_label_update_success
source: Picture Class label successfully updated.
de: Bildklassenbeschriftung erfolgreich aktualisiert.

# add_picture_from_camera_tooltip
source: Add Picture from Camera
de: Bild von der Kamera hinzufügen

# empty_images_screen_message
source: No images in the collection. Please use Camera to add images to collection and label them.
de: Keine Bilder in der Kollektion. Bitte verwenden Sie die Kamera, um Bilder zur Kollektion hinzuzufügen und sie zu beschriften.

# nothing_to_export
source: No images in the collection, nothing to export.
de: Keine Bilder in der Kollektion, nichts zu exportieren.

# collection_exported_to_file
source: Collection exported to file '{path}'
de: Kollektion exportiert in Datei '{path}'

# error_during_export
source: Error during export: '{message}'
de: Fehler beim Exportieren: '{message}'

# picture_deleted_from_collection
source: Picture successfully deleted from collection.
de: Bild erfolgreich aus der Kollektion gelöscht..
